from enum import Enum

from telegram import InlineKeyboardButton, ReplyKeyboardMarkup


class MusicEducation(Enum):
    PRIMARY = "Начальное"
    SECONDARY = "Среднее"
    HIGHER = "Высшее"
    SELF = "Самоучка"


class Replies(Enum):
    PROFILE = "Посмотреть мой профиль 🔍"
    EDIT = "Заполнить профиль заново ✍️"
    VIEW = "Смотреть анкеты 🚀"

    LIKE = "❤️"
    DISLIKE = "👎"

    START = "Привет, роцкер, заполни анкету, чтобы продолжить\nВведи свое имя:"
    FACULTY = "Введи факультет на котором учишься:"
    COURSE = "Введи курс на котором ты учишься:"
    EDUCATION = "Выбери уровень своего музыкального образования:"
    DESC = """Расскажи о себе, можешь ориентироваться на следующие пункты
1. Опыт игры, сколько и на чём играешь?
2. Музыка - это больше хобби или путь жизни?
3. Какую музыку слушаешь? 
4. Что нравится? (5 коллективов или музыкантов) 
5. Что не нравится? (5 коллективов или музыкантов)
6. Твое отношение к каверам и своим песням.
7. Опыт игры в группе
8. Кого ищёшь для реализации творческого начала?"""
    LINK = "Пришли ссылку на яндекс диск с твоими  материалами (демки, записи игры на инструменте и т.д.)"

    MAIN_MARKUP = ReplyKeyboardMarkup(
        [
            [PROFILE],
            [EDIT],
            [VIEW],
        ],
        resize_keyboard=True,
        one_time_keyboard=True,
    )
    LIKE_MARKUP = ReplyKeyboardMarkup(
        [
            [LIKE, DISLIKE],
            [PROFILE],
        ],
        resize_keyboard=True,
        one_time_keyboard=True,
    )
